app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = $1  [["user_id", 2]]
---
  def index
    @histories = History.where(user_id: current_user.id)

INSERT INTO "histories" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-12-14 18:04:54.351277"], ["updated_at", "2019-12-14 18:04:54.351277"]]
---
  def create
    @history = History.new(history_params)

    respond_to do |format|
      if @history.save

UPDATE "histories" SET "title" = $1, "updated_at" = $2 WHERE "histories"."id" = $3  [["title", "Teste"], ["updated_at", "2019-12-14 18:08:35.491981"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @history.update(history_params)

SELECT "histories".* FROM "histories" WHERE "histories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])