app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "cf109a"], ["LIMIT", 1]]
UPDATE "links" SET "clicked" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["clicked", 1], ["updated_at", "2019-12-24 14:55:14.478140"], ["id", 1]]
---
  def show
    @link = Link.find_by_slug(params[:slug])
    render 'errors/404', status: 404 if @link.nil?
    @link.update_attribute(:clicked, @link.clicked + 1)