app/controllers/payments_controller.rb

  def index
    @sales = Sale.where(user_id: current_user.id)
---
SELECT "sales".* FROM "sales" WHERE "sales"."user_id" = $1  [["user_id", 1]]

  def create_qr_payment
    price = 0.01
    total = price * params[:quantity].to_i
    reference_id = rand(100..1000000)
    @sale = Sale.create(reference_id: reference_id.to_s, quantity: params[:quantity].to_i, price: price, total: total, user_id: current_user.id, status: 'pending')
---
INSERT INTO "sales" ("quantity", "price", "total", "status", "user_id", "created_at", "updated_at", "reference_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"